---
kind: method
id: M:Autodesk.Revit.DB.OverrideGraphicSettings.SetCutBackgroundPatternVisible(System.Boolean)
source: html/04a9f8a6-665d-00f3-875f-bff5bc2bf2d1.htm
---
# Autodesk.Revit.DB.OverrideGraphicSettings.SetCutBackgroundPatternVisible Method

Sets the visibility of the cut face background fill pattern.

## Syntax (C#)
```csharp
public OverrideGraphicSettings SetCutBackgroundPatternVisible(
	bool fillPatternVisible
)
```

## Parameters
- **fillPatternVisible** (`System.Boolean`) - Value of the visibility of the cut face background fill pattern.

## Returns
Reference to the changed object.